<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Assets.car</key>
		<data>
		oLEWCPTlpSTven+/sswqE4KVO4E=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/12t-It-2xf-view-8QJ-o7-8pE.nib</key>
		<data>
		8XDwptoKlmrR5vWke/ojh732hiw=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/Info.plist</key>
		<data>
		uGbTQKyf2YDeiTIQT1291v54S88=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/MainMenu.nib</key>
		<data>
		6FVBKhjbuvjXMRWtVLCta0U3guk=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/N8K-A4-I90-view-N5N-qG-Ikq.nib</key>
		<data>
		H/c6SA8odRajIYylyodBD/mw/BI=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/NSTabViewController-hJC-B0-FI2.nib</key>
		<data>
		ibmJjuhdlLc+ZVl5TbqSd5vQESM=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/NSWindowController-0ED-aI-qmd.nib</key>
		<data>
		ODEhcUDlRcVnKPhTyH/EFn9aoMg=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/NSWindowController-KGb-L0-adL.nib</key>
		<data>
		jw2C3KjmGPCkT5p3wwAx9ZRji4I=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/NSWindowController-Uql-ut-3Gv.nib</key>
		<data>
		1/umhtQeIS5Nuq8f/z1hYBZn0Pk=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/New Task Window Controller.nib</key>
		<data>
		t8zgn75QUVR5KNLWkDz3nrjIFvU=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/XfG-lQ-9wD-view-m2S-Jp-Qdl.nib</key>
		<data>
		VC5mJ5GKyp7kOa8Yg2azH+u25Yo=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/YPh-hA-Mbt-view-3gF-t9-qr1.nib</key>
		<data>
		Ycm6uwDXECZMk1yxB9g6GATuQF8=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/e3A-ZH-rmc-view-aES-mg-3Rp.nib</key>
		<data>
		2kTFC8GB+rkuIT6wodl2jo4q64c=
		</data>
		<key>Resources/Base.lproj/Main.storyboardc/wfB-dt-Xar-view-zxA-ZR-2aM.nib</key>
		<data>
		38SscXNa33UW6RPIM+052FTK0Rk=
		</data>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/coremldata.bin</key>
		<data>
		3oqnvNFbiuloQ06VOrniiFCMh3w=
		</data>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model.espresso.net</key>
		<data>
		AyK3E6BL7TzIfRLTshRicBE/BIg=
		</data>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model.espresso.shape</key>
		<data>
		xJDRt3Vt02LCQm7Qh0KciWIuWqQ=
		</data>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model.espresso.weights</key>
		<data>
		mK/0TmqjO/cK6up/Ry5RWJvGQEg=
		</data>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model/coremldata.bin</key>
		<data>
		ywn4n/q5e9oWqKg072wL3kxD++I=
		</data>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		4SnyfFEDvFzES83woV4WDURQZv8=
		</data>
		<key>Resources/StarGalaxyClassifier.mlmodelc/coremldata.bin</key>
		<data>
		vQXozRACQwLBkxjc6Topcgw5MSs=
		</data>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model.espresso.net</key>
		<data>
		j4pEp6ylwHKql/1iXneRm9StLEI=
		</data>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model.espresso.shape</key>
		<data>
		JiH/mUTWZp/3kQaRtntwbbJHojs=
		</data>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model.espresso.weights</key>
		<data>
		S54HtPNOap6DOlO0u5UDDnFKj8Y=
		</data>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model/coremldata.bin</key>
		<data>
		ywn4n/q5e9oWqKg072wL3kxD++I=
		</data>
		<key>Resources/StarGalaxyClassifier.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		4SnyfFEDvFzES83woV4WDURQZv8=
		</data>
		<key>Resources/templates/template1.png</key>
		<data>
		nXgy+kyxMPwdl2wQSJmZoeWFRIo=
		</data>
		<key>Resources/templates/template2.png</key>
		<data>
		AYZAE8t9o2QRs6ZCPOU40JABooI=
		</data>
		<key>Resources/templates/template3.png</key>
		<data>
		ukDcDESg1qGBvZYkjckQhstM61g=
		</data>
		<key>Resources/templates/template4.png</key>
		<data>
		/Ki2wMYDsgZl4V7J8kdN4Zrc1Yg=
		</data>
		<key>Resources/templates/template5.png</key>
		<data>
		1mGmdldyFBLMDhdhNeSoJM7J1R0=
		</data>
		<key>Resources/templates/template6.png</key>
		<data>
		I3UrIUivtl5rItHArbEsp4FvB3k=
		</data>
		<key>Resources/templates/template7.png</key>
		<data>
		JLMpfbnpXaVsQCYvLP6z7BdlQIs=
		</data>
		<key>Resources/templates/template8.png</key>
		<data>
		MTGQr/MzZaO4IEib0FH0GuiMWyw=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Frameworks/KRActivityIndicatorView.framework</key>
		<dict>
			<key>cdhash</key>
			<data>
			pHjP2QM3Qvz/yxM0Nk7so2fMSSM=
			</data>
			<key>requirement</key>
			<string>identifier "com.henryforce.KRActivityIndicatorView" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftAVFoundation.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			Uc+uF2MZ2XprtJTIgXsxeZ/N1xI=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftAVFoundation" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftAppKit.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			TDrPtuVOZdn8RuDC3K5xET4V8Ts=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftAppKit" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCore.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			SF4okevgjOWWW1I4o9LXmQuj5pM=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCore" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCoreAudio.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			GTE8k8cfN2WwHJ2iosJx/IK2/4k=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCoreAudio" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCoreData.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			z7ZfVu+fOVpsf7xJz5AZg2T2ojg=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCoreData" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCoreFoundation.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			AkQ39xyaoGcKJvPjO6OhGLX/I/Y=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCoreFoundation" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCoreGraphics.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			0IjAiChtMmINlfAkfi9Ir0lFBy4=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCoreGraphics" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCoreImage.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			UdaCyGcfVKA4RJIbU7EMXhtTvVM=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCoreImage" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftCoreMedia.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			aprzpqacf/qrz6bhE33GjEiEy2o=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftCoreMedia" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftDarwin.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			44fzNTj1zH5FKh7AQWN8kcfN8gw=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftDarwin" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftDispatch.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			wtuBt2J90Xn6zdvtwINDfbzfZSw=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftDispatch" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftFoundation.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			fJa8KYMyytkZ1y1BnTiRakpUXu0=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftFoundation" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftIOKit.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			nOtPIiMLvinfPmAOWZVZwzNv9HY=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftIOKit" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftMetal.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			2oy9PIYe1vFIkWV+tIlilu8r4DI=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftMetal" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftObjectiveC.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			f1Vb57f7zwG9MLSLv59IYLblE8c=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftObjectiveC" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftQuartzCore.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			HZIuEV809G6FmHERpKeVi55PL0g=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftQuartzCore" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftVision.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			L0IcsSZsJEn2UeLhtf/aBlisygc=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftVision" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftXPC.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			VAsSCWExsD+YJWMslx2r9bHlKzg=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftXPC" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftos.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			tjYcY1p+UdEcE3gN1XsXn8VpXNQ=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftos" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Frameworks/libswiftsimd.dylib</key>
		<dict>
			<key>cdhash</key>
			<data>
			WcM7xK3cVP/a1ytBz3Qx/sfdOoI=
			</data>
			<key>requirement</key>
			<string>identifier "com.apple.dt.runtime.swiftsimd" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: ahmadaussaili@gmail.com (8HFFE69YC9)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
		</dict>
		<key>Resources/Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			9ckdPOLhNVUsX7BI4TMBiXrFOT9ZWUplTQDjb4p8dIw=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/12t-It-2xf-view-8QJ-o7-8pE.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			U5H/xMRnzmvis2tra5+up7lvuAR7Wb1g2SruJYQQ8bc=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			FANAEqCuvGYk1pCDALgpod2vqCx+nKnqTQVH/Rjz/Qg=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/MainMenu.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			gTmV90QjcCVl3gcscxXBj3wtOZgZx5vioqD72YME03I=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/N8K-A4-I90-view-N5N-qG-Ikq.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			7OuOTW5e+AAUJtP55MgczV8GB6/5z8r7pAmwy0aHFSo=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/NSTabViewController-hJC-B0-FI2.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			6QTmMhOuzaD6xIjrUUXYsqtoUJ325VFb37nnq/8Fp24=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/NSWindowController-0ED-aI-qmd.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			tO/Q6Jpn251D0cgv3U1jjdYxo7Jyr3CV+8J0BtwcNFQ=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/NSWindowController-KGb-L0-adL.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			B6mHS8ixN6m2RLi2v1+O+XYDS00HZwH2+ih49pyHb3c=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/NSWindowController-Uql-ut-3Gv.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			wNTlseLf0UkcbCZBEQnGc7Iaq3fe6D/3duBVIVYlb3Y=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/New Task Window Controller.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			X4KqWUMRgAYDlpOVYxyv5XqMKTI5Td4aasCSlYhsqrM=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/XfG-lQ-9wD-view-m2S-Jp-Qdl.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			5hVClLqyanddK50rLdSeyWU34qWzZ6ObvqEk7QkIaA4=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/YPh-hA-Mbt-view-3gF-t9-qr1.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			z95gUa9i5QVsGSHOX3iJr/iZR9vSqW6K3HsMuigVQCk=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/e3A-ZH-rmc-view-aES-mg-3Rp.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			gWBVN5j6kuVRge0uH9tnHxj0gjdokEDLfFLvoDpDFLQ=
			</data>
		</dict>
		<key>Resources/Base.lproj/Main.storyboardc/wfB-dt-Xar-view-zxA-ZR-2aM.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			Ov+EVo9oUgCBHaHBN2OcQjE5C1kkoVoHcAmPM0rB5aY=
			</data>
		</dict>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			w2CW/hrGpOfJjvmtZpCfuVqbvsFD2jH0GVQI0DefVU4=
			</data>
		</dict>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			HqcF8qGBv5e69S+0hlMF9ctWOT1xi4b2sFIKbB8pmpQ=
			</data>
		</dict>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			TZnLTXxR5pel9tMv4VEeO2gaRALtliHwBTDurHB4+68=
			</data>
		</dict>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			Hrv1D5EHITJjE5VQfQR/X2jBo4jx/7Lj39Ygzpge9G0=
			</data>
		</dict>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5dyN3LM4GYt7lwcO9RVnniqLVWBb4ulR7mi8PQho7bg=
			</data>
		</dict>
		<key>Resources/GalaxyMorphologyClassifier.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			N0cI//dxndWXnsh11WzSKG9tPPfsMXo7JWMqqyjsN7s=
			</data>
		</dict>
		<key>Resources/StarGalaxyClassifier.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			R9eiEMFjAm+YAfLW0vfVql6knlDetNWFv119SSYZ/vE=
			</data>
		</dict>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			x/mt3+6TsbvbaPmNn/HIvhQWw5wr1j1KBab7C5mKGus=
			</data>
		</dict>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			/1u7+K0liFqAwYhr4SeiGcIk7jCGeacLN0TPuMdM/0g=
			</data>
		</dict>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			W9jS8cX8z8AePB4I+ECyJ/Q/B19PhDhC6+EJ7EY3lFQ=
			</data>
		</dict>
		<key>Resources/StarGalaxyClassifier.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5dyN3LM4GYt7lwcO9RVnniqLVWBb4ulR7mi8PQho7bg=
			</data>
		</dict>
		<key>Resources/StarGalaxyClassifier.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			N0cI//dxndWXnsh11WzSKG9tPPfsMXo7JWMqqyjsN7s=
			</data>
		</dict>
		<key>Resources/templates/template1.png</key>
		<dict>
			<key>hash2</key>
			<data>
			PXu6Q9qUdetQDoIi5awkWg1KoIWZ9r3PTN9Jq3URckU=
			</data>
		</dict>
		<key>Resources/templates/template2.png</key>
		<dict>
			<key>hash2</key>
			<data>
			XCOuH8CflPuxy5lPOmlNhl9Z5dqyeWxp8Hj3dL/CUKw=
			</data>
		</dict>
		<key>Resources/templates/template3.png</key>
		<dict>
			<key>hash2</key>
			<data>
			9Yo+ccwz/mXi6jjGfwVar+rBrLhHNZ6alwO3keDzXpo=
			</data>
		</dict>
		<key>Resources/templates/template4.png</key>
		<dict>
			<key>hash2</key>
			<data>
			bFlt+uks91RSKarys08A70MYt5ZwkTXGrtvOdTEhSDU=
			</data>
		</dict>
		<key>Resources/templates/template5.png</key>
		<dict>
			<key>hash2</key>
			<data>
			JJmZzyW2YOtxUJVvm4Rq/vsILmsyjyq7IyrunlA2yV4=
			</data>
		</dict>
		<key>Resources/templates/template6.png</key>
		<dict>
			<key>hash2</key>
			<data>
			DAIWhf8r7trftzk2QmBpnZn/vkSJTrWIqFzevUO6+3Q=
			</data>
		</dict>
		<key>Resources/templates/template7.png</key>
		<dict>
			<key>hash2</key>
			<data>
			8c4CRMoofay0Vy5sPzwzueX0sL+/DNci2rThEGJzT58=
			</data>
		</dict>
		<key>Resources/templates/template8.png</key>
		<dict>
			<key>hash2</key>
			<data>
			ldLaiarWcjRakg8hdL+jgzu0amp8/C4wFUDDDQUGWFQ=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
